tap "adoptopenjdk/openjdk"
tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "gap-system/gap"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Java build tool
brew "ant"
# New file format for still image compression
brew "jpeg-xl"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Record and share terminal sessions
brew "asciinema"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Compiler for writing next generation JavaScript
brew "babel"
# GNU binary tools for native development
brew "binutils"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Collection of portable C++ source libraries
brew "boost"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, lightweight programming language
brew "lua"
# Elegant Lua unit testing
brew "busted"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Next-generation test runner for Rust
brew "cargo-nextest"
# GNU multiple precision arithmetic library
brew "gmp"
# C library for multiple-precision floating-point computations
brew "mpfr"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for building toolchains
brew "crosstool-ng"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line utilities for working with desktop entries
brew "desktop-file-utils"
# Minimal, fast alternative to 'du -sh'
brew "diskus"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", restart_service: :changed
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Debian package management system
brew "dpkg"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# VP8/VP9 video codec
brew "libvpx"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg@2.8"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Database of common MIME types
brew "shared-mime-info"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Library for manipulating fonts
brew "fonttools", link: false
# Libpcap-based NetFlow probe
brew "fprobe"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Assuan IPC Library
brew "libassuan"
# Library for USB device access
brew "libusb"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU Privacy Guard (OpenPGP)
brew "gnupg@1.4"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Package for scientific computing with Python
brew "numpy"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Proof-of-work algorithm to counter denial-of-service (DoS) attacks
brew "hashcash"
# Post-modern modal text editor
brew "helix"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Dex to Java decompiler
brew "jadx"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for JSON, based on GLib
brew "json-glib"
# High fidelity 2D graphics library for C++
brew "libagg"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Low level NFC SDK and Programmers API
brew "libnfc"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# XML security library
brew "libxmlsec1"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm@19"
# Language Server for the Lua language
brew "lua-language-server"
# Java-based project management
brew "maven"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Command-line music player client for mpd
brew "mpc"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Libraries for security-enabled client and server applications
brew "nss"
# Statically typed programming language for scientific computations
brew "numbat"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk@11"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Convert bitmaps to vector graphics
brew "potrace"
# Advanced Python REPL
brew "ptpython"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# Develop and deploy code with zero configuration
brew "railway"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rename multiple files in a directory
brew "ren"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Build tool for Scala projects
brew "sbt"
# Multi-media library with bindings for multiple languages
brew "sfml"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to impose load on and stress test a computer system
brew "stress"
# Stress test a computer system in various selectable ways
brew "stress-ng"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Markup-based typesetting system
brew "typst"
# Web Assembly Binary Toolkit
brew "wabt"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Focus-follows-mouse for MacOS
brew "dimentium/autoraise/autoraise", args: ["with-dalternative_task_switcher"]
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Universal chat app powered by Matrix
cask "beeper"
cask "font-sf-mono"
cask "font-sf-pro"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git client focusing on productivity
cask "gitkraken"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Java IDE by JetBrains
cask "intellij-idea"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Minecraft modding platform
cask "modrinth"
# Control your tools with a few keystrokes
cask "raycast"
# Mathematics software system
cask "sage"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# App that enables mouse-free UI interaction
cask "shortcat"
# Compiler for the Standard ML '97 programming language
cask "smlnj"
# System monitor for the menu bar
cask "stats"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Multiplayer code editor
cask "zed@preview"
# Gecko based web browser
cask "zen@twilight"
cargo "bat"
cargo "cargo-binstall"
cargo "cargo-bisect-rustc"
cargo "cargo-cache"
cargo "cargo-expand"
cargo "cargo-generate"
cargo "cargo-leptos"
cargo "cargo-llvm-cov"
cargo "cargo-make"
cargo "cargo-show-asm"
cargo "cross"
cargo "evcxr_repl"
cargo "eza"
cargo "flamegraph"
cargo "leptosfmt"
cargo "ripgrep"
cargo "shiroa"
cargo "tokei"
cargo "trunk"
cargo "typstyle"
cargo "wasm-bindgen-cli"
cargo "wasm-pack"
